src/cf/DataProcessors/ГенерацияСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ГенерацияСертификатов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>СтатусыСертификатов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСертификатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыСертификатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/ГенерацияСертификатов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервереБезКонтекста
Процедура СгенерироватьНаСервере(ПараметрыГенерации)
	
	Для х=1 По ПараметрыГенерации.Количество Цикл
		НовыйСертификат = Справочники.Сертификаты.СоздатьЭлемент();
		НовыйСертификат.Наименование = ПараметрыГенерации.Наименование;
		НовыйСертификат.Номинал = ПараметрыГенерации.Номинал;
		Попытка
			НовыйСертификат.Записать();
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		Менеджер = РегистрыСведений.СтатусыСертификатов.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДата();
		Менеджер.Сертификат = НовыйСертификат.Ссылка;
		Менеджер.Статус = Перечисления.СтатусыСертификатов.Создан;
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	ПараметрыГенерации = Новый Структура;
	ПараметрыГенерации.Вставить("Количество", ЭтотОбъект.КоличествоСертификатов);
	ПараметрыГенерации.Вставить("Номинал", ЭтотОбъект.Номинал);
	ПараметрыГенерации.Вставить("Наименование", ЭтотОбъект.Наименование);
	СгенерироватьНаСервере(ПараметрыГенерации);
КонецПроцедуры

#КонецОбласти
